
//#define EVENTSPAWN_TEST_MODE			//テストモ?ド
//#define EVENTSPAWN_TEST_MODE			//テストモ?ド


//全体進行周期 (分)
#define		EVENTSPAWN_PLAYING_TIME		15			
//開始周期 (分)
#define		EVENTSPAWN_OPEN_TIME		60			


///////////////////////////////// 42番フィ?ルド設定デ??/////////////////////////////////

static POINT EventSpawn_42_Posi = { -3647, -46307 };			//中央座標
static int  EventSpawn_42_Range = 350;					//半径

//?ャット命令語
static char *szEventSpawn_Order42[][3] = {
	{ "イビエドクビラ", "?殿秘書 : 主はただ今外出しております。また後程いらしていただけますか？" , "?殿?ス : 我と戦いたいなら、まず我の部下を?してみろ！そうしたら相手をしてやる！" },
	{ "イクワクブラ", "?殿秘書 : 主はただ今外出しております。また後程いらしていただけますか？" , "?殿?ス : 我と戦いたいなら、まず我の部下を?してみろ！そうしたら相手をしてやる！" },
	{ "クベルティグヒ", "?殿秘書 : 主はただ今外出しております。また後程いらしていただけますか？" , "?殿?ス : 我と戦いたいなら、まず我の部下を?してみろ！そうしたら相手をしてやる！" },
	{ 0,0 }
};

//一般モンス??
sHCORE_MONSTER	sHCore_EventSpawn42 =
//     Monster1					 Monster2				Monster3					Monster4				Monster5	モンス??召還確立合			10分後に?スモンス??出現						3匹			10秒ごと
	{ { "呪われた???" , 0, 45 },		{ "呪われたオ??", 0, 30 },		{ "呪われたキングホピ?", 0, 20 },		{ "呪われたメトロン", 0, 5 },		{ "", 0, 0 },	100,					10,						0,			3,			10 };   //10秒ごと3匹
	//合計(設定100) , 10*60秒後?ス出現,  X , 5匹ごとに , 10秒ごとに


/*
//?スモンス??
sHCORE_MONSTER	sHCore_EventSpawn42_Boss[] = {
	{ { "呪われたウイッ?", 0, 25 }		, { "呪われたウイッ?", 0, 25 }		, { "呪われた インキュバス" , 0, 25 }	, { "呪われたインキュバス" , 0, 25 }	, { "", 0, 0 }	, 100 , 0 , 80   , 1 , 0},
	{ { "呪われたサキュバス", 0, 25 }	, { "呪われたサキュバス", 0, 25 }	, { "呪われたｲﾝｷｭﾊﾞｽｻﾏﾅ?"   , 0, 25 }	, { "呪われたｲﾝｷｭﾊﾞｽｻﾏﾅ?"   , 0, 25 }	, { "", 0, 0 }	, 100 , 0 , 179   , 1 , 0},
	{ { "呪われたスティジアン", 0, 25 }	, { "呪われたスティジアン", 0, 25 }	, { "呪われたカオスカラ"     , 0, 25 }	, { "呪われたカオスカラ"     , 0, 25 }	, { "", 0, 0 }	, 100 , 0 , 1000 , 1 , 0},
	{ { "", 0, 20 }						, { "", 0, 20 }			      		, { "", 0, 40 }						, { "" , 0, 20 }					, { "", 0, 0 }	, 100 , 0 , 50   , 1 , 0},										
	{ { "" , 0, 0 } 					, { "", 0, 0 } 						, { "", 0, 0 } 						, { "", 0, 0 } 						, { "", 0, 0 }	, 0	  , 0 , 0    , 0 , 0}
};
*/

//?スモンス??
sHCORE_MONSTER	sHCore_EventSpawn42_Boss[] = {
	{ { "呪われたウイッ?", 0, 25 }		, { "呪われた インキュバス" , 0, 25 }	, { "呪われたウイッ?", 0, 25 }		, { "呪われたインキュバス" , 0, 25 }	, { "", 0, 0 }	, 100 , 0 , 80   , 1 , 0},
	{ { "呪われたサキュバス", 0, 25 }	, { "呪われたｲﾝｷｭﾊﾞｽｻﾏﾅ?"   , 0, 25 }	, { "呪われたサキュバス", 0, 25 }	, { "呪われたｲﾝｷｭﾊﾞｽｻﾏﾅ?"   , 0, 25 }	, { "", 0, 0 }	, 100 , 0 , 179   , 1 , 0},
	{ { "呪われたスティジアン", 0, 25 }	, { "呪われたカオスカラ"     , 0, 25 }	, { "呪われたスティジアン", 0, 25 }	, { "呪われたカオスカラ"     , 0, 25 }	, { "", 0, 0 }	, 100 , 0 , 1000 , 1 , 0},
	{ { "", 0, 20 }						, { "", 0, 20 }			      		, { "", 0, 40 }						, { "" , 0, 20 }					, { "", 0, 0 }	, 100 , 0 , 50   , 1 , 0},										
	{ { "" , 0, 0 } 					, { "", 0, 0 } 						, { "", 0, 0 } 						, { "", 0, 0 } 						, { "", 0, 0 }	, 0	  , 0 , 0    , 0 , 0}
};
