/*----------------------------------------------------------------------------*
*	파일명 :  AssaParticle
*	하는일 :  아싸! 파티클
*	작성일 :  최종업데이트 2002년 12월
*	적성자 :  박상열 
*-----------------------------------------------------------------------------*/	
#ifndef _ASSA_TESTPARTICLE_HEADER_

#define _ASSA_TESTPARTICLE_HEADER_

/*----------------------------------------------------------------------------*
*								함수 
*-----------------------------------------------------------------------------*/	

//프로세스
void sinAssaParticleTestProcess(cASSAEFFECT *pEffect); 
//파티클 테스트 
int sinAssaParticleTestKeyDown();	 

/*----------------------------------------------------------------------------*
*								TEST Particle 함수 
*-----------------------------------------------------------------------------*/	

int AssaParticle_TEST2(POINT3D *pPosi );

#endif
